Tekla.Structures.Dialog.UIControls.WpfControlUtil
Class containing helper methods for WPF controls.

Tekla.Structures.Dialog.UIControls.WpfControlUtil.GetParentWindow(System.Windows.DependencyObject)
Finds control's parent window.
child: child control

Tekla.Structures.Dialog.UIControls.WpfControlUtil.ApplyFusionStyle(Tekla.Structures.Dialog.WindowBase@)
Applies fusion style to controls if fusion is loaded.
mainWindow: parent control

Tekla.Structures.Dialog.UIControls.WpfControlUtil.FixWindowChromeWorker(Tekla.Structures.Dialog.WindowBase@)
Wires up a special hook on the window that handles the WM_NCHITTEST 32-bit integer overflow problem when "System.Windows.Shell.WindowChrome" is used.
mainWindow: parent control
Returns:
Remarks:
This hook should be setup immediately after instantiation.
Otherwise some other code may end up handling the event first (and still cause the System.OverflowException).

Tekla.Structures.Dialog.UIControls.WpfControlUtil.HookProc(System.IntPtr,System.Int32,System.IntPtr,System.IntPtr,System.Boolean@)
Handles the Windows message.
hwnd: The handle to the window.
msg: The message being received.
wParam: Additional information about the message.
lParam: Additional information about the message.
handled: Determines whether the message was handled.
Returns: A zero value if the default window procedure processes the message; a nonzero value if the default window procedure ignores the message.

Tekla.Structures.Dialog.UIControls.WpfControlUtil.FindLogicalChildren``1(System.Windows.DependencyObject)
Finds parent's child controls.
obj: parent control

Tekla.Structures.Dialog.UIControls.WpfControlUtil.SetAllToggleFilters(Tekla.Structures.Dialog.WindowBase,System.Boolean)
Set all filter checkbox controls of parent window with given value.
parentWindow: parent window
value: value to set to filter check boxes

Tekla.Structures.Dialog.UIControls.WpfControlUtil.SetToggleFilter(Tekla.Structures.Dialog.WindowBase,System.String,System.Boolean)
Set filter checkbox control for given dialog attribute of parent window with given value.
parentWindow: parent window
attributeName: dialog attribute name
value: value to set to filter check boxes

Tekla.Structures.Dialog.UIControls.WpfControlUtil.GetEventFieldInfos(System.Type)
Gets possible events from type
type: The object type

Tekla.Structures.Dialog.UIControls.WpfControlUtil.UnscribeFromEvents(Tekla.Structures.Dialog.WindowBase@)
Removes event handlers from view model of window. Was causing a memory leak with dialogs (GC never released memory)
window: window